rubbin1/Example_STM32F407ZGT6/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define KEY2_Pin GPIO_PIN_2
#define KEY2_GPIO_Port GPIOE
#define KEY1_Pin GPIO_PIN_3
#define KEY1_GPIO_Port GPIOE
#define KEY0_Pin GPIO_PIN_4
#define KEY0_GPIO_Port GPIOE
#define OLED_D6_Pin GPIO_PIN_5
#define OLED_D6_GPIO_Port GPIOE
#define OLED_D7_Pin GPIO_PIN_6
#define OLED_D7_GPIO_Port GPIOE
#define LIGHT_SENSOR_Pin GPIO_PIN_7
#define LIGHT_SENSOR_GPIO_Port GPIOF
#define BUZZER_Pin GPIO_PIN_8
#define BUZZER_GPIO_Port GPIOF
#define LED0_Pin GPIO_PIN_9
#define LED0_GPIO_Port GPIOF
#define LED1_Pin GPIO_PIN_10
#define LED1_GPIO_Port GPIOF
#define KEY_UP_Pin GPIO_PIN_0
#define KEY_UP_GPIO_Port GPIOA
#define OLED_RW_Pin GPIO_PIN_4
#define OLED_RW_GPIO_Port GPIOA
#define TOUCH_KEY_Pin GPIO_PIN_5
#define TOUCH_KEY_GPIO_Port GPIOA
#define OLED_D0_Pin GPIO_PIN_6
#define OLED_D0_GPIO_Port GPIOC
#define OLED_D1_Pin GPIO_PIN_7
#define OLED_D1_GPIO_Port GPIOC
#define OLED_D2_Pin GPIO_PIN_8
#define OLED_D2_GPIO_Port GPIOC
#define OLED_D3_Pin GPIO_PIN_9
#define OLED_D3_GPIO_Port GPIOC
#define OLED_D4_Pin GPIO_PIN_11
#define OLED_D4_GPIO_Port GPIOC
#define OLED_DC_Pin GPIO_PIN_6
#define OLED_DC_GPIO_Port GPIOD
#define OLED_RD_Pin GPIO_PIN_7
#define OLED_RD_GPIO_Port GPIOD
#define OLED_RST_Pin GPIO_PIN_15
#define OLED_RST_GPIO_Port GPIOG
#define OLED_D5_Pin GPIO_PIN_6
#define OLED_D5_GPIO_Port GPIOB
#define OLED_CS_Pin GPIO_PIN_7
#define OLED_CS_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
